Autodesk.Revit.DB.DimensionType.SetAlternateUnitsFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
Remarks:
See the UnitType property to determine the unit type of this dimension style.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The display unit in formatOptions is not a valid display unit for the unit type of this DimensionType.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL